[
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/gene/DATA/gene2accession.gz",
    "target": "s3://viz.fredhutch.org.public.data/gene/DATA/gene2accession/gene2accession",
    "update": "recalculated daily",
    "desc": " This file is a comprehensive report of the accessions that are related to a GeneID.  It includes sequences from the international sequence collaboration, Swiss-Prot, and RefSeq. The RefSeq subset of this file is also available as gene2refseq.  Because this file is updated daily, the RefSeq subset does not reflect any RefSeq release. Versions of RefSeq RNA and protein records may be more recent than those included in an annotation release (build) or those in the current RefSeq release.  To identify the annotation release/build to which the genomic RefSeqs belong, please refer to the species-specific README_CURRENT_RELEASE or README_CURRENT_BUILD file in the genomes ftp site:  ftp://ftp.ncbi.nih.gov/genomes/  For example: ftp://ftp.ncbi.nih.gov/genomes/H_sapiens/README_CURRENT_RELEASE ftp://ftp.ncbi.nih.gov/genomes/Ailuropoda_melanoleuca/README_CURRENT_BUILD  More notes about this file:  tab-delimited one line per genomic/RNA/protein set of sequence accessions Column header line is the first line in the file.  NOTE: Because this file is comprehensive, it may include some RefSeq accessions that are not current, because they are part of the annotation of the current genomic assembly. In other words, the annotation of a genome is not continuous, but depends on a data freeze. Sub-genomic RefSeqs, however, are updated continuously. Thus some RefSeqs may have been replaced or suppressed after a data freeze assocated with a genomic annotation. Until the release of a new genomic annotation, all RefSeqs that are included in the current annotation are reported in this file. ",
    "fields": {
      "tax_id": "the unique identifier provided by NCBI Taxonomy for the species or strain/isolate ",
      "geneid": "the unique identifier for a gene ",
      "status": "status of the RefSeq if a refseq, else '-' RefSeq values are: INFERRED, MODEL, NA, PREDICTED, PROVISIONAL, REVIEWED, SUPPRESSED, VALIDATED ",
      "rna_nucleotide_accession_version": "may be null (-) for some genomes ",
      "rna_nucleotide_gi": "the gi for an RNA nucleotide accession, '-' if not applicable ",
      "protein_accession_version": "will be null (-) for RNA-coding genes ",
      "protein_gi": "the gi for a protein accession, '-' if not applicable ",
      "genomic_nucleotide_accession_version": "may be null (-) ",
      "genomic_nucleotide_gi": "the gi for a genomic nucleotide accession, '-' if not applicable ",
      "start_position_on_the_genomic_accession": "position of the gene feature on the genomic accession, '-' if not applicable position 0-based NOTE: this file does not report the position of each exon. For positions on RefSeq contigs and chromosomes, use the gff3 file in the appropriate build directory. For example, for the human genome, ftp://ftp.ncbi.nih.gov/genomes/H_sapiens/GFF/ This file has one line for each feature. WARNING: Positions in gff3 files are one-based, not 0-based NOTE: if genes are merged after an annotation is released, there may be more than one location reported on a genomic sequence per GeneID, each resulting from the annotation before the merge. ",
      "end_position_on_the_genomic_accession": "position of the gene feature on the genomic accession, '-' if not applicable position 0-based NOTE: this file does not report the position of each exon. For positions on RefSeq contigs and chromosomes, use the gff3 file in the appropriate build directory. For example, for the human genome, ftp://ftp.ncbi.nih.gov/genomes/H_sapiens/GFF/ This file has one line for each feature. WARNING: Positions in gff3 files are one-based, not 0-based NOTE: if genes are merged after an annotation is released, there may be more than one location reported on a genomic sequence per GeneID, each resulting from the annotation before the merge. ",
      "orientation": "orientation of the gene feature on the genomic accession, '?' if not applicable ",
      "assembly": "the name of the assembly '-' if not applicable ",
      "mature_peptide_accession_version": "will be null (-) if absent ",
      "mature_peptide_gi": "the gi for a mature peptide accession, '-' if not applicable ",
      "symbol": "the default symbol for the gene "
    }
  },
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/gene/DATA/gene2ensembl.gz",
    "target": "s3://viz.fredhutch.org.public.data/gene/DATA/gene2ensembl/gene2ensembl.gz",
    "update": "recalculated daily",
    "desc": " This file reports matches between NCBI and Ensembl annotation based on comparison of rna and protein features.  Matches are collected as follows. For a protein to be identified as a match between RefSeq and Ensembl, there must be at least 80% overlap between the two. Furthermore, splice site matches must meet certain conditions: either 60% or more of the splice sites must match, or there may be at most one splice site mismatch.  For rna features, the best match between RefSeq and Ensembl is selected based on splice site and overlap comparisons. For coding transcripts, there is no minimum threshold for reporting other than the protein comparison criteria above. For non-coding transcripts, the splice site criteria are the same as for protein matching, but the overlap threshold is reduced to 50%.  Furthermore, both the rna and the protein features must meet these minimum matching criteria to be considered a good match.  In addition, only the best matches will be reported in this file. Other matches that satisified the matching criteria but were not the best matches will not be reported in this file.  A summary report of species that have been compared is contained in another FTP file, README_ensembl (see next item).  More notes about this file:  tab-delimited one line per match between RefSeq and Ensembl rna/protein Column header line is the first line in the file.   ",
    "fields": {
      "tax_id": "the unique identifier provided by NCBI Taxonomy for the species or strain/isolate ",
      "geneid": "the unique identifier for a gene ",
      "ensembl_gene_identifier": "the matching Ensembl identifier for the gene ",
      "rna_nucleotide_accession_version": "the identifier for the matching RefSeq rna will be null (-) if only the protein matched ",
      "ensembl_rna_identifier": "the identifier for the matching Ensembl rna may include a version number will be null (-) if only the protein matched ",
      "protein_accession_version": "the identifier for the matching RefSeq protein will be null (-) if only the mRNA matched ",
      "ensembl_protein_identifier": "the identifier for the matching Ensembl protein may include a version number will be null (-) if only the mRNA matched "
    }
  },
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/gene/DATA/gene2vega",
    "target": "",
    "update": "archived",
    "desc": " This file is no longer being updated.  The last update was on December 3, 2018.  This file reports matches between NCBI and Vega annotation.  Matches are derived from the comparisons between NCBI and Ensembl annotation (which are reported in the gene2ensembl FTP file).  That is, where there is a match between NCBI and Ensembl annotation, and there is a correspondence between that Ensembl annotation and Vega annotation, then the inferred relationship between the NCBI and Vega annotations are reported here.  More notes about this file:  tab-delimited one line per match between RefSeq and Vega rna/protein Column header line is the first line in the file.   ",
    "fields": {
      "tax_id": "the unique identifier provided by NCBI Taxonomy for the species or strain/isolate ",
      "geneid": "the unique identifier for a gene ",
      "vega_gene_identifier": "the matching Vega identifier for the gene ",
      "rna_nucleotide_accession_version": "the identifier for the matching RefSeq rna will be null (-) if only the protein matched ",
      "vega_rna_identifier": "the identifier for the matching Vega rna may include a version number will be null (-) if only the protein matched ",
      "protein_accession_version": "the identifier for the matching RefSeq protein will be null (-) if only the mRNA matched ",
      "vega_protein_identifier": "the identifier for the matching Vega protein may include a version number will be null (-) if only the mRNA matched "
    }
  },
  {
    "transfer": "ftp",
    "source": "README_ensembl",
    "target": "",
    "update": "recalculated weekly",
    "desc": " This file reports the overall status of comparison between NCBI and Ensembl annotation.  The detailed report is contained in the gene2ensembl FTP file (see previous item).  More notes about this file:  tab-delimited one line per species Column header line is the first line in the file.  ",
    "fields": {
      "tax_id": "the unique identifier provided by NCBI Taxonomy for the species or strain/isolate ",
      "ncbi_release": "the NCBI release number ",
      "ncbi_assembly": "the NCBI assembly name ",
      "ensembl_release": "the Ensembl release number ",
      "ensembl_assembly": "the Ensembl assembly name ",
      "date_compared": "the date when the comparison was performed, in YYYYMMDD format "
    }
  },
  {
    "transfer": "ftp",
    "source": "gene2go",
    "target": "",
    "update": "recalculated daily",
    "desc": " This file reports the GO terms that have been associated with Genes in Entrez Gene. It is generated by processing the gene_association files on the GO ftp site: http://www.geneontology.org/GO.current.annotations.shtml and comparing the DB_Object_ID to annotation in Gene, as also reported in gene_info.gz  Multiple gene_associations file may be used for any genome. If so, duplicate information is not reported; but unique contributions of GO terms, evidence codes, and citations are.  The file that is used to establish the rules for the files and fields that are used for each taxon is documented in go_process.xml   MODIFIED: May 9, 2006 to include the category of the GO term.  MODIFIED: May 21, 2007 to use '-' for empty fields.  Data elements which are not applicable are shown as '-'.  tab-delimited One line per GeneID/GO term/representative GO evidence code. Column header line is the first line in the file. ",
    "fields": {
      "tax_id": "the unique identifier provided by NCBI Taxonomy for the species or strain/isolate ",
      "geneid": "the unique identifier for a gene ",
      "go_id": "the GO ID, formatted as GO:0000000 ",
      "evidence": "the evidence code in the gene_association file ",
      "qualifier": "a qualifier for the relationship between the gene and the GO term ",
      "go_term": "the term indicated by the GO ID ",
      "pubmed": "pipe-delimited set of PubMed uids reported as evidence for the association ",
      "category": "the GO category (Function, Process, or Component) "
    }
  },
  {
    "transfer": "ftp",
    "source": "gene2pubmed",
    "target": "",
    "update": "recalculated daily",
    "desc": " This file can be considered as the logical equivalent of what is reported as Gene/PubMed Links visible in Gene's and PubMed's Links menus. Although gene2pubmed is re-calculated daily, some of the source documents (GeneRIFs, for example) are not updated that frequently, so timing depends on the update frequency of the data source.  Documentation about how these links are maintained is provided here:  https://www.ncbi.nlm.nih.gov/entrez/query/static/entrezlinks.html#gene  tab-delimited one line per set of tax_id/GeneID/PMID Column header line is the first line in the file. ",
    "fields": {
      "tax_id": "the unique identifier provided by NCBI Taxonomy for the species or strain/isolate ",
      "geneid": "the unique identifier for a gene ",
      "pubmed_id_(pmid)": "the unique identifier in PubMed for a citation "
    }
  },
  {
    "transfer": "ftp",
    "source": "gene2refseq",
    "target": "",
    "update": "recalculated daily",
    "desc": " tab-delimited one line per genomic/RNA/protein set of RefSeqs Column header line is the first line in the file.  Because this file is updated daily, the RefSeq subset does not reflect any RefSeq release. Versions of RefSeq RNA and protein records may be more recent than those included in an annotation release (build) or those in the current RefSeq release.  To identify the annotation release/build to which the genomic RefSeqs belong, please refer to the species-specific README_CURRENT_RELEASE or README_CURRENT_BUILD file in the genomes ftp site:  ftp://ftp.ncbi.nih.gov/genomes/  For example: ftp://ftp.ncbi.nih.gov/genomes/H_sapiens/README_CURRENT_RELEASE ftp://ftp.ncbi.nih.gov/genomes/Ailuropoda_melanoleuca/README_CURRENT_BUILD    NOTE: Because this file is comprehensive, it may include some RefSeq accessions that are not current, because they are part of the annotation of the current genomic assembly. In other words, the annotation of a genome is not continuous, but depends on a data freeze. Sub-genomic RefSeqs, however, are updated continuously. Thus some RefSeqs may have been replaced or suppressed after a data freeze associated with a genomic annotation. Until the release of a new genomic annotation, all RefSeqs included in the current annotation are reported in this file.   NOTE: This file is the RefSeq subset of gene2accession. ",
    "fields": {
      "tax_id": "the unique identifier provided by NCBI Taxonomy for the species or strain/isolate ",
      "geneid": "the unique identifier for a gene ",
      "status": "status of the RefSeq values are: INFERRED, MODEL, NA, PREDICTED, PROVISIONAL, REVIEWED, SUPPRESSED, VALIDATED ",
      "rna_nucleotide_accession_version": "may be null (-) for some genomes ",
      "rna_nucleotide_gi": "the gi for an RNA nucleotide accession, '-' if not applicable ",
      "protein_accession_version": "will be null (-) for RNA-coding genes ",
      "protein_gi": "the gi for a protein accession, '-' if not applicable ",
      "genomic_nucleotide_accession_version": "may be null (-) if a RefSeq was provided after the genomic accession was submitted ",
      "genomic_nucleotide_gi": "the gi for a genomic nucleotide accession, '-' if not applicable ",
      "start_position_on_the_genomic_accession": "position of the gene feature on the genomic accession, '-' if not applicable position 0-based NOTE: this file does not report the position of each exon for positions on RefSeq contigs and chromosomes, use the gff format files in the desired build directory at ftp://ftp.ncbi.nlm.nih.gov/genomes/refseq/ For example, for human at the time this was written: ftp://ftp.ncbi.nlm.nih.gov/genomes/refseq/vertebrate_mammalian/Homo_sapiens/all_assembly_versions/GCF_000001405.31_GRCh38.p5/GCF_000001405.31_GRCh38.p5_genomic.gff.gz WARNING: positions in these files are one-based, not 0-based NOTE: if genes are merged after an annotation is released, there may be more than one location reported on a genomic sequence per GeneID, each resulting from the annotation before the merge. ",
      "end_position_on_the_genomic_accession": "position of the gene feature on the genomic accession, '-' if not applicable position 0-based NOTE: this file does not report the position of each exon for positions on RefSeq contigs and chromosomes, use the gff format files in the desired build directory at ftp://ftp.ncbi.nlm.nih.gov/genomes/refseq/ For example, for human at the time this was written: ftp://ftp.ncbi.nlm.nih.gov/genomes/refseq/vertebrate_mammalian/Homo_sapiens/all_assembly_versions/GCF_000001405.31_GRCh38.p5/GCF_000001405.31_GRCh38.p5_genomic.gff.gz WARNING: positions in these files are one-based, not 0-based NOTE: if genes are merged after an annotation is released, there may be more than one location reported on a genomic sequence per GeneID, each resulting from the annotation before the merge. ",
      "orientation": "orientation of the gene feature on the genomic accession, '?' if not applicable ",
      "assembly": "the name of the assembly '-' if not applicable ",
      "mature_peptide_accession_version": "will be null (-) if absent ",
      "mature_peptide_gi": "the gi for a mature peptide accession, '-' if not applicable ",
      "symbol": "the default symbol for the gene "
    }
  },
  {
    "transfer": "ftp",
    "source": "gene2sts",
    "target": "",
    "update": "archived",
    "desc": " This file is no longer being updated.  The last update was on July 26, 2017.  tab-delimited one line per GeneID, UniSTS ID pair Column header line is the first line in the file. ",
    "fields": {
      "geneid": "the unique identifier for a gene ",
      "unists_id": "the unique identifier given to a primer pair by UniSTS "
    }
  },
  {
    "transfer": "ftp",
    "source": "gene2unigene",
    "target": "",
    "update": "archived",
    "desc": " This file is no longer being updated.  The last update was on June 19, 2019.  This file can be considered as the logical equivalent of what is reported as Gene/UniGene Links visible in Gene's and UniGene's Links menus.  Documentation about how these links are maintained is provided here:  https://www.ncbi.nlm.nih.gov/entrez/query/static/entrezlinks.html  tab-delimited Column header line is the first line in the file. Note: tax_id is not provided in a separate column.  The prefix of the UniGene cluster can be used to determine the species ",
    "fields": {
      "geneid": "the unique identifier for a gene ",
      "unigene_cluster": " "
    }
  },
  {
    "transfer": "ftp",
    "source": "gene_group",
    "target": "",
    "update": "recalculated daily",
    "desc": " report of genes and their relationships to other genes  tab-delimited one line per pair of GeneIDs Column header line is the first line in the file.  NOTE: This file is not comprehensive, and contains a subset of information summarizing gene-gene relationships.  Relationships are reported symmetrically, where appropriate, and currently include:  Ortholog* Potential readthrough sibling Readthrough child Readthrough parent Readthrough sibling Region member Region parent Related functional gene Related pseudogene  *Note that Ortholog records appear in the gene_orthologs file, and are excluded from the gene_group file. Note also that the gene_group and gene_orthologs files use the same column format.  ",
    "fields": {
      "tax_id": "the unique identifier provided by NCBI Taxonomy for the species or strain/isolate ",
      "geneid": "the current unique identifier for a gene ",
      "relationship": "the type of relationship between the two genes, e.g. GeneID has a 'relationship' to Other GeneID ",
      "other_tax_id": "the related gene's tax_id ",
      "other_geneid": "the related gene's GeneID "
    }
  },
  {
    "transfer": "ftp",
    "source": "gene_history",
    "target": "",
    "update": "recalculated daily",
    "desc": " comprehensive information about GeneIDs that are no longer current  tab-delimited one line per GeneID Column header line is the first line in the file. ",
    "fields": {
      "tax_id": "the unique identifier provided by NCBI Taxonomy for the species or strain/isolate ",
      "geneid": "the current unique identifier for a gene ",
      "discontinued_geneid": "the GeneID that is no longer current ",
      "discontinued_symbol": "the symbol that was assigned to the discontinued GeneID, if the discontinued record was not replaced with another ",
      "discontinue_date": "the date the gene record was discontinued or replaced, in YYYYMMDD format "
    }
  },
  {
    "transfer": "ftp",
    "source": "gene_info",
    "target": "",
    "update": "recalculated daily",
    "desc": " tab-delimited one line per GeneID Column header line is the first line in the file. Note: subsets of gene_info are available in the DATA/GENE_INFO directory (described later) ",
    "fields": {
      "tax_id": "the unique identifier provided by NCBI Taxonomy for the species or strain/isolate ",
      "geneid": "the unique identifier for a gene ASN1:  geneid ",
      "symbol": "the default symbol for the gene ASN1:  gene->locus ",
      "locustag": "the LocusTag value ASN1:  gene->locus-tag ",
      "synonyms": "bar-delimited set of unofficial symbols for the gene ",
      "dbxrefs": "bar-delimited set of identifiers in other databases for this gene.  The unit of the set is database:value. Note that HGNC and MGI include 'HGNC' and 'MGI', respectively, in the value part of their identifier.  Consequently, dbXrefs for these databases will appear like: HGNC:HGNC:1100 This would be interpreted as database='HGNC', value='HGNC:1100' Example for MGI: MGI:MGI:104537 This would be interpreted as database='MGI', value='MGI:104537' ",
      "chromosome": "the chromosome on which this gene is placed. for mitochondrial genomes, the value 'MT' is used. ",
      "map_location": "the map location for this gene ",
      "description": "a descriptive name for this gene ",
      "type_of_gene": "the type assigned to the gene according to the list of options provided in https://www.ncbi.nlm.nih.gov/IEB/ToolBox/CPP_DOC/lxr/source/src/objects/entrezgene/entrezgene.asn ",
      "symbol_from_nomenclature_authority": "when not '-', indicates that this symbol is from a a nomenclature authority ",
      "full_name_from_nomenclature_authority": "when not '-', indicates that this full name is from a a nomenclature authority ",
      "nomenclature_status": "when not '-', indicates the status of the name from the nomenclature authority (O for official, I for interim) ",
      "other_designations": "pipe-delimited set of some alternate descriptions that have been assigned to a GeneID '-' indicates none is being reported. ",
      "modification_date": "the last date a gene record was updated, in YYYYMMDD format ",
      "feature_type": "pipe-delimited set of annotated features and their classes or controlled vocabularies, displayed as feature_type:feature_class or feature_type:controlled_vocabulary, when appropriate; derived from select feature annotations on RefSeq(s) associated with the GeneID "
    }
  },
  {
    "transfer": "ftp",
    "source": "gene_neighbors",
    "target": "",
    "update": "recalculated daily",
    "desc": " This file reports neighboring genes for all genes placed on a given genomic sequence.  More notes about this file:  tab-delimited one line per GeneID and genomic placement Column header line is the first line in the file. genomic sequences in scope for reporting include all top-level sequences and curated genomic (NG_ accessions)  ",
    "fields": {
      "tax_id": "the unique identifier provided by NCBI Taxonomy for the species or strain/isolate ",
      "geneid": "the unique identifier for a gene ",
      "genomic_accession_version": "",
      "genomic_gi": "the gi for a genomic nucleotide accession ",
      "start_position": "start position of the gene feature on the genomic accession position value is 0-based ",
      "end_position": "end position of the gene feature on the genomic accession position value is 0-based ",
      "orientation": "orientation of the gene feature on the genomic accession ",
      "chromosome": "the chromosome on which this gene is placed. for mitochondrial genomes, the value 'MT' is used. '-' if not applicable ",
      "geneids_on_left": "bar-delimited set of GeneIDs for the nearest two non-overlapping genes on the left, or '-' if there are none additional GeneIDs may be included if the neighboring genes overlap each other ",
      "distance_to_left": "distance to the nearest gene on the left, or '-' if there is none ",
      "geneids_on_right": "bar-delimited set of GeneIDs for the nearest two non-overlapping genes on the right, or '-' if there are none additional GeneIDs may be included if the neighboring genes overlap each other ",
      "distance_to_right": "distance to the nearest gene on the right, or '-' if there is none ",
      "overlapping_geneids": "bar-delimited set of GeneIDs for all overlapping genes, or '-' if there are none ",
      "assembly": "the name of the assembly '-' if not applicable "
    }
  },
  {
    "transfer": "ftp",
    "source": "mim2gene_medgen",
    "target": "",
    "update": "daily",
    "desc": " report of the relationship between MIM numbers (OMIM), GeneIDs, and Records in MedGen  tab-delimited one line per MIM number Column header line is the first line in the file. Tax_id is not included because this file is relevant only for human, tax_id 9606. see also: http://omim.org/help/faq In June, 2015, this file was modified to add a Comment column, to qualify the relationship between a gene and a disorder as reported by OMIM.  ",
    "fields": {
      "mim_number": "a MIM number associated with a GeneID ",
      "geneid": "the current unique identifier for a gene the lack of a GeneID, for whatever reason, is represented as a '-' ",
      "type": "type of relationship between the MIM number and the GeneID current values are 'gene'      the MIM number associated with a Gene, or a GeneID that is assigned to a record where the molecular basis of the disease is not known 'phenotype' the MIM number associated with a disease that is associated with a gene If NCBI has no record of this MIM number in its databases yet, there is a '-' provided in the type column ",
      "source": "This value is provided only when there is a report of a relationship between a MIM number that is a phenotype, and a GeneID. The current expected values are GeneMap (from OMIM), GeneReviews, and NCBI. ",
      "medgencui": "The accession assigned by MedGen to this phenotype.  If the accession starts with a C followed by integers, the identifier is a concept ID (CUI) from UMLS. https://www.nlm.nih.gov/research/umls/  If it starts with a CN, no CUI in UMLS was identified, and NCBI created a placeholder. ",
      "comment": "optional value reporting the qualifiers OMIM provides when reporting a gene/phenotype relationship The values are based on the explanation of the symbols provided by OMIM: http://omim.org/help/faq nondisease: Brackets, \"[ ]\", indicate \"nondiseases,\" mainly genetic variations that lead to apparently abnormal laboratory test values (e.g., dysalbuminemic euthyroidal hyperthyroxinemia). susceptibility: {} indicate mutations that contribute to susceptibility to multifactorial disorders QTL 1: {} and qtl QTL 2: [] and qtl somatic: somatic in the disease name question: A question mark, \"?\", before the disease name indicates an unconfirmed or possibly spurious mapping. "
    }
  },
  {
    "transfer": "ftp",
    "source": "generifs_basic.gz",
    "target": "",
    "desc": " GeneRIFs describing a single Gene each (rather than interactions between two genes' products)  Tab-delimited Sorted by Tax ID, Gene ID, and the first PubMed ID in the list  For more information, please review: https://www.ncbi.nlm.nih.gov/gene/about-generif ",
    "fields": {
      "tax_id": "the unique identifier provided by NCBI Taxonomy for the species or strain/isolate ",
      "gene_id": "the unique identifier for a gene ",
      "pubmed_id_(pmid)_list": "unique citation identifier(s) in PubMed; multiple values are comma-separated NOTE: if you process this by Excel, please be certain to treat this column as a string. Otherwise comma-delimited PubMed uids may be converted to a single integer  ",
      "last_update_timestamp": "the last time this GeneRIF was modified, in ISO 8601 format \"yyyy-mm-dd hh:mm\" ",
      "generif_text": "GeneRIF text string, length <= 425 characters "
    }
  },
  {
    "transfer": "ftp",
    "source": "hiv_interactions.gz",
    "target": "",
    "desc": " Descriptions of interactions between two genes' products -- specifically, one from Human and one from Human Immunodeficiency Virus type 1 (HIV-1) -- from a collaboration with NIAID  For more information, please see: https://www.ncbi.nlm.nih.gov/genome/viruses/retroviruses/hiv-1/interactions/  This file contains a subset of the interaction data reported in interactions.gz, described below.  Tab-delimited Sorted by:  human Gene ID, human accession.version, virus Gene ID, virus accession.version, first PubMed ID in the list ",
    "fields": {
      "first_gene_of_interacting_pair_(virus_interactant)": "Tax ID 1 the unique identifier provided by NCBI Taxonomy for the species or strain/isolate Gene ID 1 the unique identifier for a gene product accession.version 1 product name 1 ",
      "interaction_short_phrase": "text string ",
      "second_gene_of_interacting_pair_(human_interactant)": "Tax ID 2 the unique identifier provided by NCBI Taxonomy for the species or strain/isolate Gene ID 2 the unique identifier for a gene product accession.version 2 product name 2 ",
      "pubmed_id_(pmid)_list": "unique citation identifier(s) in PubMed; multiple values are comma-separated NOTE: if you process this by Excel, please be certain to treat this column as a string. Otherwise comma-delimited PubMed uids may be converted to a single integer ",
      "last_update_timestamp": "the last time this GeneRIF was modified, in ISO 8601 format \"yyyy-mm-dd hh:mm\" ",
      "generif_text": "text string, length <= 425 characters "
    }
  },
  {
    "transfer": "ftp",
    "source": "hiv_siRNA_interactions.gz",
    "target": "",
    "desc": " Descriptions of HIV-1 virus and human protein interactions that regulate HIV-1 replication and infectivity.  All interactions are with Human immunodeficiency virus 1 (NC_001802.1, Tax ID 11676).  Tab-delimited ",
    "fields": {
      "tax_id": "the unique identifier provided by NCBI Taxonomy for the species or strain/isolate ",
      "gene_id": "the unique identifier for a gene ",
      "interaction_short_phrase": "text string ",
      "product_accession_version": "",
      "product_name": "",
      "pubmed_id_(pmid)_list": "unique citation identifier(s) in PubMed; multiple values are comma-separated NOTE: if you process this by Excel, please be certain to treat this column as a string. Otherwise comma-delimited PubMed uids may be converted to a single integer ",
      "last_update_timestamp": "the last time this GeneRIF was modified, in ISO 8601 format \"yyyy-mm-dd hh:mm\" ",
      "generif_text": "text string, length <= 425 characters "
    }
  },
  {
    "transfer": "ftp",
    "source": "interactions.gz",
    "target": "",
    "desc": " Descriptions of interactions involving up to two interactants and a resulting complex, at least one of which is a gene product.  If both interactants are associated with Gene IDs, the interacting pair is reported once, using the convention that the interactant with the smaller Gene ID is listed as the \"first interactant\", as defined below.  This file includes the interaction data reported in hiv_interactions.gz and hiv_siRNA_interactions.gz, described above.  Data elements which are not applicable are shown as \"-\".  Tab-delimited Sorted by:  1st Tax ID, 1st Gene ID, 1st accession.version, 2nd Tax ID,              2nd accession.version, first PubMed ID in the list ",
    "fields": {
      "first_interactant": "Tax ID 1 the unique identifier provided by NCBI Taxonomy for the species or strain/isolate Gene ID 2 the unique identifier for a gene interactant accession.version 1 interactant name 1 ",
      "interaction_short_phrase": "text string ",
      "second_interactant": "Tax ID 2 the unique identifier provided by NCBI Taxonomy for the species or strain/isolate interactant ID 2 an identifier for this interactant, within the database specified by \"interactant ID type\" below --  note:  depending on the database, this ID may be either a numeric value or a character string interactant ID type the database within which the interactant ID may be found; if this interactant is a gene product, its interactant ID type is \"GeneID\", and the interactant ID is its numeric Gene ID. interactant accession.version 2 interactant name 2 ",
      "resulting_complex": "complex ID an identifier for this complex, within the database specified by \"complex ID type\" below --  note:  depending on the database, this ID may be either a numeric value or a character string complex ID type the database within which the complex ID may be found complex name ",
      "pubmed_id_(pmid)_list": "unique citation identifier(s) in PubMed; multiple values are comma-separated NOTE: if you process this by Excel, please be certain to treat this column as a string. Otherwise comma-delimited PubMed uids may be converted to a single integer ",
      "last_update_timestamp": "the last time this GeneRIF was modified, in ISO 8601 format \"yyyy-mm-dd hh:mm\" ",
      "generif_text": "text string, length <= 425 characters ",
      "interaction_source": "interaction ID an identifier for this interaction, within the database specified by \"interaction ID type\" below --  note:  depending on the database, this ID may be either a numeric value or a character string interaction ID type the database within which the interaction ID may be found; if there is no interaction ID, no interaction ID type is reported  additional information on interaction source databases is in the file interaction_sources, described below. "
    }
  },
  {
    "transfer": "ftp",
    "source": " interaction_sources",
    "target": "",
    "desc": " Additional information on sources of interactions listed in interactions.gz, described above.  Tag/value pairs, one per line, delimited by colon and whitespace Sources delimited by blank lines Sorted by symbol ",
    "fields": {
      "symbol": "the symbol used to represent this source in interactions.gz ",
      "webpage_url": "the primary or general Web page for this source ",
      "template_url": "a prefix which, when combined with the interaction ID from a specific interaction record in interactions.gz, produces a full URL which accesses further information on that interaction from the source's Web site "
    }
  }
]
