[
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/disease_names",
    "target": "s3://viz.fredhutch.org.public.data/pub/clinvar/disease_names/disease_names",
    "update": "daily",
    "desc": " This document is provided to report the names and identifiers used in GTR and ClinVar. Please note there may be more than one line per condition, when a name is used by more than one source. This differs from the gene_condition_source_id file because it is comprehensive, and does not require knowledge of any gene-to-disease relationship.",
    "fields": [
      {
        "name": "diseasename",
        "desc": "The name preferred by GTR and ClinVar.",
        "type": "string"
      },
      {
        "name": "sourcename",
        "desc": "Sources that also use this preferred name.",
        "type": "string"
      },
      {
        "name": "conceptid",
        "desc": " The identifier assigned to a disorder associated with this  gene. If the value starts with a C and is followed by digits, the ConceptID is a value from UMLS; if a value begins with CN,it was created by NCBI-based processing.",
        "type": "string"
      },
      {
        "name": "sourceid",
        "desc": "Identifier used by the source reported in column 2.",
        "type": "string"
      },
      {
        "name": "diseasemim",
        "desc": "MIM number for the condition.",
        "type": "string"
      },
      {
        "name": "lastupdated",
        "desc": "Last time this record was modified by NCBI staff.",
        "type": "string"
      },
      {
        "name": "category",
        "desc": "Category of disease (as reported in ClinVar's XML), one of: Blood group, Disease, Findng, Name protein variant,Pharmacological response, phenotype instruction",
        "type": "string"
      }
    ]
  },
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/gene_condition_source_id",
    "target": "s3://viz.fredhutch.org.public.data/pub/clinvar/gene_condition_source_id/gene_condition_source_id",
    "update": "Updated daily.",
    "desc": "This document is updated daily, and is provided to report gene-disease relationships used in ClinVar, Gene, GTR and MedGen. The sources of information for the gene-disease relationship include OMIM, GeneReviews, and a limited amount of curation by NCBI staff. The scope of disorders reported in this file is a subset of the disease_names file because a gene-to-disease relationship is required.",
    "fields": [
      { "name": "geneid", "desc": "The NCBI GeneID.", "type": "string" },
      {
        "name": "genesymbol",
        "desc": "The preferred symbol corresponding to the GeneID.",
        "type": "string"
      },
      {
        "name": "conceptid",
        "desc": "The identifier assigned to a disorder associated with this gene. If the value starts with a C and is followed by digits, the ConceptID is a value from UMLS; if a value begins with CN, it was created by NCBI-based processing.",
        "type": "string"
      },
      {
        "name": "diseasename",
        "desc": "Full name for the condition.",
        "type": "string"
      },
      {
        "name": "sourcename",
        "desc": "Sources that use this name.",
        "type": "string"
      },
      {
        "name": "sourceid",
        "desc": "The identifier used by this source.",
        "type": "string"
      },
      {
        "name": "diseasemim",
        "desc": "MIM number for the condition.",
        "type": "string"
      },
      {
        "name": "lastupdated",
        "desc": "Last time this record was modified by NCBI staff. ",
        "type": "string"
      }
    ]
  },
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/ConceptID_history.txt",
    "target": "s3://viz.fredhutch.org.public.data/pub/clinvar/conceptid_history/conceptid_history",
    "update": "Updated daily.",
    "desc": "This document is provided to help track changes in identifiers assigned to phenotypes over time. The ConceptID values in the first column are no longer active, and are either discontinued (the value in column 2 is 'No longer reported', or replaced by a record with a different identifier.  That replacement may result either because of a merge (one record becoming secondary to another) or because of a change in numbering, usually because an identifier assigned by NCBI (starting with CN) is now thought to berepresented by a ConceptID from UMLS (starting with C followed by numerals). ",
    "fields": [
      {
        "name": "previous conceptid",
        "desc": "The outdated identifier.",
        "type": "string"
      },
      {
        "name": "current conceptid",
        "desc": "The current identifier.",
        "type": "string"
      },
      {
        "name": "date of action",
        "desc": "The date this change occurred. ",
        "type": "string"
      }
    ]
  },
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/gene_specific_summary.txt",
    "target": "s3://viz.fredhutch.org.public.data/pub/clinvar/gene_specific_summary/gene_specific_summary",
    "update": "Generated weekly.",
    "desc": "A tab-delimited report, for each gene, of the number of submissions and the number of different variants (alleles). Because some variant-gene relationships are submitted, and some are calculated from overlapping annotation, in January of 2015, the report was modified to indicate when the gene-variant relationship was submitted. Although this report is generated each week, it is currently based on statistics that are captured the first day of each month. Therefore there will be some discrepancies between what is reported in this file and what may be viewed interactively on the web. ",
    "fields": [
      {
        "name": "symbol",
        "desc": "Gene symbol (if officially named, from HGNC, else from NCBI's Gene database).",
        "type": "string"
      },
      {
        "name": "geneid",
        "desc": "Unique identifier from  NCBI's Gene database.",
        "type": "string"
      },
      {
        "name": "total_submissions",
        "desc": "Total submissions to ClinVar with variants in/overlapping this gene.",
        "type": "string"
      },
      {
        "name": "total_alleles",
        "desc": "Number of alleles submitted to ClinVar for this gene.",
        "type": "string"
      },
      {
        "name": "submissions_reporting_this_gene",
        "desc": "Subset of the total submissions that also reported the gene.",
        "type": "string"
      },
      {
        "name": "alleles_reported_pathogenic_likely_pathogenic",
        "desc": "Number of variants reported as pathogenic or likely pathogenic. Excludes structural variants that may overlap a gene.",
        "type": "string"
      },
      {
        "name": "gene_mim_number",
        "desc": "The MIM number for this gene.",
        "type": "string"
      },
      {
        "name": "number_uncertain",
        "desc": "Submissions with an interpretation of 'Uncertain significance'.",
        "type": "string"
      },
      {
        "name": "number_with_conflicts",
        "desc": "Number of VariationIDs for this gene with conflicting interpretations. ",
        "type": "string"
      }
    ]
  },
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/variant_summary.txt.gz",
    "target": "s3://viz.fredhutch.org.public.data/pub/clinvar/variant_summary/variant_summary",
    "update": "Generated weekly.",
    "desc": "A tab-delimited report based on each variant at a location on the genome for which data have been submitted to ClinVar. The data for the variant are reported for each assembly, so most variants have a line for GRCh37 (hg19) and another line for GRCh38 (hg38). Please note: Beginning in October 2016, this file was modified to restrict reporting to attributes of an AlleleID, not a mixture of AlleleID and VariationID.  The modifications were announced in our September 2016 release notes:  ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/release_notes/20160901_data_release_notes.pdf. The last file that reported VariationID was ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/archive/variant_summary_2016-09.txt.gz The first with the new set of columns is ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/archive/variant_summary_2016-10.txt.gz Content that used to be in this file may be found in ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/hgvs4variation.txt.gz ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/variation_allele.txt.gz See also the authoritative file for identifiers assigned to genes represented by NCBI, namely: ftp://ftp.ncbi.nih.gov/gene/DATA/GENE_INFO/Mammalia/Homo_sapiens.gene_info.gz",
    "fields": [
      {
        "name": "alleleid",
        "desc": "integer value as stored in the AlleleID field in ClinVar (MeasureID in the XML)",
        "type": "string"
      },
      {
        "name": "type",
        "desc": "Character, the type of variant represented by the AlleleID.",
        "type": "string"
      },
      {
        "name": "name",
        "desc": "Character, ClinVar's preferred name for the record with this AlleleID.",
        "type": "string"
      },
      {
        "name": "geneid",
        "desc": "Integer, GeneID in NCBI's Gene database, reported if there is a single gene, otherwise reported as -1.",
        "type": "string"
      },
      {
        "name": "genesymbol",
        "desc": "Character, comma-separated list of GeneIDs overlapping the variant.",
        "type": "string"
      },
      {
        "name": "hgnc_id",
        "desc": "String, of format HGNC:integer, reported if there is a single GeneID",
        "type": "string"
      },
      {
        "name": "clinicalsignificance",
        "desc": "Character, comma-separated list of aggregate values of clinical significance calculated for this variantIf the value is 'no interpretation for the single variant', this allele was submitted to ClinVar as part of a haplotype or genotype, and its specific significance has not been submitted to ClinVar. NOTE: Now that the aggregate values of clinical significance give precedence to records with assertion criteria and evidence, the values in this column may appear to be in conflict with the value reported in ClinSigSimple.",
        "type": "string"
      },
      {
        "name": "clinsigsimple",
        "desc": "Integer, 0 = no current value of Likely pathogenic or Pathogenic. 1 = at least one current record submitted with an interpretation of Likely pathogenic or Pathogenic (independent of whether that record includes assertion criteria and evidence). -1 = no values for clinical significance at all for this variant or set of variants; used for the 'included' variants that are only in ClinVar because they are included in a haplotype or genotype with an interpretation NOTE: Now that the aggregate values of clinical significance give precedence to records with assertion criteria and evidence, the values in this column may appear to be in conflict with the value reported in ClinicalSignificance.  In other words, if a submission without assertion criteria and evidence interpreted an allele as pathogenic, and those with assertion criteria and evidence interpreted as benign, then ClinicalSignificance would be reported as Benign and ClinSigSimple as 1.",
        "type": "string"
      },
      {
        "name": "lastevaluated",
        "desc": "Date, the latest date any submitter reported Integer, rs# in dbSNPclinical significance.",
        "type": "string"
      },
      { "name": "rs", "desc": "Integer, rs# in dbSNP.", "type": "string" },
      {
        "name": "nsvesv",
        "desc": "Character, the NSV identifier for the region in dbVar.",
        "type": "string"
      },
      {
        "name": "rcvaccession",
        "desc": "Character, list of RCV accessions that report this variant.",
        "type": "string"
      },
      {
        "name": "phenotypeids",
        "desc": "Character, list of identifiers for phenotype(s) interpreted for this variant.",
        "type": "string"
      },
      {
        "name": "phenotypelist",
        "desc": "Character, list of names corresponding to PhenotypeIDs",
        "type": "string"
      },
      {
        "name": "origin",
        "desc": "Character, list of all allelic origins for this variant.",
        "type": "string"
      },
      {
        "name": "originsimple",
        "desc": "Character, processed from Origin to make it easier to distinguish between germline and somatic.",
        "type": "string"
      },
      {
        "name": "assembly",
        "desc": "Character, name of the assembly on which locations are based.",
        "type": "string"
      },
      {
        "name": "chromosomeaccession",
        "desc": "Accession and version of the RefSeq sequence defining the position reported in the start and stop columns. Please note some of these accessions may be for sub-chromosomal regions.",
        "type": "string"
      },
      {
        "name": "chromosome",
        "desc": "Character, chromosomal location.",
        "type": "string"
      },
      {
        "name": "start",
        "desc": "Integer, starting location, in pter->qter orientation.",
        "type": "string"
      },
      {
        "name": "stop",
        "desc": "Integer, end location, in pter->qter orientation.",
        "type": "string"
      },
      {
        "name": "referenceallele",
        "desc": "The allele at the location defined by start and stop on the reference sequence.",
        "type": "string"
      },
      {
        "name": "alternateallele",
        "desc": "The difference relative to that reference.",
        "type": "string"
      },
      {
        "name": "cytogenetic",
        "desc": "Character, ISCN band.",
        "type": "string"
      },
      {
        "name": "reviewstatus",
        "desc": "Character, highest review status for reporting this measure. For the key to the terms, and their relationship to the star graphics ClinVar displays on its web pages, see http://www.ncbi.nlm.nih.gov/clinvar/docs/variation_report/#interpretation. Note also that 'no interpretation for the single variant' is used for AlleleIDs in ClinVar that were submitted as part of the definition of a complex allele, but not interpreted individually.",
        "type": "string"
      },
      {
        "name": "numbersubmitters",
        "desc": "Integer, number of submitters describing this variant.",
        "type": "string"
      },
      {
        "name": "guidelines",
        "desc": "Character, ACMG only right now, for the reporting of incidental variation in a Gene enumerates whether the guideline is from 2013 (ACMG2013, PubMed 23788249) or 2016 (ACMG2016, PubMed 27854360). (NOTE: if ACMG, not a specific to the AlleleID but to the Gene in which the AlleleID is found).",
        "type": "string"
      },
      {
        "name": "testedingtr",
        "desc": "Character, Y/N for Yes/No if there is a test registered as specific to this variant in the NIH Genetic Testing Registry (GTR).",
        "type": "string"
      },
      {
        "name": "otherids",
        "desc": "Character, list of other identifiers or sources of information about this variant.",
        "type": "string"
      },
      {
        "name": "submittercategories",
        "desc": "Coded value to indicate whether data were submitted by another resource (1), any other type of source (2) or both (3).",
        "type": "string"
      },
      {
        "name": "variationid",
        "desc": "The identifier ClinVar uses specific to the AlleleID.  Not all VariationIDS that may be related to the AlleleID are reported in this file. For a comprehensive mapping of AlleleID to VariationID, please use ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/variation_allele.txt.gz.  Note also that some of the values for VariationID are not supported in the current default web display, but will be reported from ClinVar 2.0 as current seen from our preview site. ",
        "type": "string"
      }
    ]
  },
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/cross_references.txt",
    "target": "s3://viz.fredhutch.org.public.data/pub/clinvar/cross_references.txt/cross_references",
    "update": "Updated weekly.",
    "desc": "A tab-delimited report based on each variant in ClinVar, providing identifiers in other databases and when those data were last updated. This file is based on AlleleID rather than VariationID for complex alleles, so it corresponds to a unique genomic location. NOTE: this file is preliminary and currently includes only identifiers in dbSNP and dbVar. Identifiers from more databases will be added in the future. ",
    "fields": [
      {
        "name": "alleleid",
        "desc": "Integer value as stored in the AlleleID field in ClinVar  (//Measure/@ID in the XML).",
        "type": "string"
      },
      { "name": "database", "desc": "Name of the database.", "type": "string" },
      {
        "name": "id",
        "desc": "Identifier used by that database.",
        "type": "string"
      },
      {
        "name": "last_updated",
        "desc": "Date the identifier /AlleleID relationship was created or last updated. ",
        "type": "string"
      }
    ]
  },
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/var_citations.txt",
    "target": "s3://viz.fredhutch.org.public.data/pub/clinvar/var_citations.txt/var_citations",
    "update": "Updated daily.",
    "desc": " ",
    "fields": [
      {
        "name": "alleleid",
        "desc": " Integer value as stored in the AlleleID field in ClinVar  (//Measure/@ID in the XML).",
        "type": "string"
      },
      {
        "name": "variationid",
        "desc": "The identifier ClinVar uses to anchor its default display. (in the XML,  //MeasureSet/@ID).",
        "type": "string"
      },
      { "name": "rs", "desc": "RS identifier from dbSNP.", "type": "string" },
      { "name": "nsv", "desc": "NSV identifier from dbVar.", "type": "string" },
      {
        "name": "citation_source",
        "desc": "The source of the citation, either PubMed, PubMedCentral, or the NCBI Bookshelf.",
        "type": "string"
      },
      {
        "name": "citation_id",
        "desc": "The identifier used by that source.",
        "type": "string"
      }
    ]
  },
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/summary_of_conflicting_interpretations.txt",
    "target": "s3://viz.fredhutch.org.public.data/pub/clinvar/summary_of_conflicting_interpretations/summary_of_conflicting_interpretations",
    "update": "Updated weekly.",
    "desc": "This file first became available in January, 2016. It replaces summary_of_conflicting_data.txt (documented below) and differs in that a. It is limited to differences in interpretation (i.e. does not report differences in the phenotype being interpreted) b. Reports all pairwise differences, so that if submitter a differs from submitters b and c, and submitter b differs from c,  a-b, a-c, b-c will all be reported instead of just a-b and a-c c. Reports fewer columns ",
    "fields": [
      {
        "name": "gene_symbol",
        "desc": "If in a gene, its symbol.",
        "type": "string"
      },
      {
        "name": "ncbi_variation_id",
        "desc": "The identifier ClinVar uses to anchor its default display. (in the XML,  //MeasureSet/@ID).",
        "type": "string"
      },
      {
        "name": "clinvar_preferred",
        "desc": "The preferred description ClinVar uses for this VariationID.",
        "type": "string"
      },
      {
        "name": "submitter1",
        "desc": "Name of this submitter.",
        "type": "string"
      },
      {
        "name": "submitter1_scv",
        "desc": "Accession assigned to this submission.",
        "type": "string"
      },
      {
        "name": "submitter1_clinsig",
        "desc": "Clinical signficance asserted by this submitter.",
        "type": "string"
      },
      {
        "name": "submitter1_lasteval",
        "desc": "Date last evaluated by this submitter.",
        "type": "string"
      },
      {
        "name": "submitter1_reviewstatus",
        "desc": "Review status of this submission.",
        "type": "string"
      },
      {
        "name": "submitter1_sub_condition",
        "desc": "Submitted name of condition.",
        "type": "string"
      },
      {
        "name": "submitter1_description",
        "desc": "Description of the interpretation.",
        "type": "string"
      },
      {
        "name": "submitter2",
        "desc": "Name of this submitter",
        "type": "string"
      },
      {
        "name": "submitter2_scv",
        "desc": "Accession assigned to this submission.",
        "type": "string"
      },
      {
        "name": "submitter2_clinsig",
        "desc": "Clinical signficance asserted by this submitter.",
        "type": "string"
      },
      {
        "name": "submitter2_lasteval",
        "desc": "Date last evaluated by this submitter.",
        "type": "string"
      },
      {
        "name": "submitter2_reviewstatus",
        "desc": "Review status of this submission.",
        "type": "string"
      },
      {
        "name": "submitter2_sub_condition",
        "desc": "Submitted name of condition.",
        "type": "string"
      },
      {
        "name": "submitter2_description",
        "desc": "Description of the interpretation.",
        "type": "string"
      },
      {
        "name": "rank_diff",
        "desc": "Rank value assigned to the differences in interpretation: -1: one of the interpretations is not in the set of Pathogenic, Likely pathogenic, Uncertain significance, Likely benign, Benign 0: difference in phenotype only 1-4, difference when both interpretations are in the set of Pathogenic, Likely pathogenic, Uncertain significance, Likely benign, Benign, where 4 is most divergent.",
        "type": "string"
      },
      {
        "name": "conflict_reported",
        "desc": "Yes or no.  Useful to supplement the Rank_diff column when Rank_diff = 1 but a conflict is still reported.",
        "type": "string"
      },
      {
        "name": "variant_type",
        "desc": "The type of variant being described.",
        "type": "string"
      },
      {
        "name": "submitter1_method",
        "desc": "The collection method(s) reported by this submitter.",
        "type": "string"
      },
      {
        "name": "submitter2_method",
        "desc": "The collection method(s) reported by this submitter. ",
        "type": "string"
      }
    ]
  },
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/variation_allele.txt.gz",
    "target": "s3://viz.fredhutch.org.public.data/pub/clinvar/variation_allele/variation_allele",
    "update": "Updated weekly.",
    "desc": "Mapping of ClinVar's VariationID (used to build the URL on the web site) and the AlleleIDs assigned to each simple variant. ",
    "fields": [
      {
        "name": "variationid",
        "desc": "The identifier assigned by ClinVar and used to build the URL, namely https://ncbi.nlm.nih.gov/clinvar/VariationID.",
        "type": "string"
      },
      {
        "name": "type",
        "desc": "Types of VariationID include Variant (simple variant), Haplotype, CompoundHeterozygote, Complex, Phase unknown, Distinct chromosomes.",
        "type": "string"
      },
      {
        "name": "alleleid",
        "desc": "The integer identifier assigned by ClinVar to each simple allele.",
        "type": "string"
      },
      {
        "name": "interpreted",
        "desc": "_yes_ indicates an interpretation was submitted about the VariationID specifically, _no_ indicates that information about the VariationID was submitted as a component of a different record. ",
        "type": "string"
      }
    ]
  },
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/submission_summary.txt.gz",
    "target": "s3://viz.fredhutch.org.public.data/pub/clinvar/submission_summary/submission_summary",
    "update": "Updated daily.",
    "desc": "Overview of interpretation, phenotypes, observations, and methods reported in each current submission. ",
    "fields": [
      {
        "name": "variationid",
        "desc": "The identifier assigned by ClinVar and used to build the URL, namely https://ncbi.nlm.nih.gov/clinvar/VariationID.",
        "type": "string"
      },
      {
        "name": "clinicalsignificance",
        "desc": "Interpretation of the variation-condition relationship.",
        "type": "string"
      },
      {
        "name": "datelastevaluated",
        "desc": "The last date the variation-condition relationship was evaluated by this submitter.",
        "type": "string"
      },
      {
        "name": "description",
        "desc": "An optional free text description of the basis of the interpretation.",
        "type": "string"
      },
      {
        "name": "submittedphenotypeinfo",
        "desc": "The name(s) or identifier(s)  submitted for the condition that was interpreted relative to the variant.",
        "type": "string"
      },
      {
        "name": "reportedphenotypeinfo",
        "desc": "The MedGen identifier/name combinations ClinVar uses to report the condition that was interpreted. 'na' means there is no public identifier in MedGen for the condition.",
        "type": "string"
      },
      {
        "name": "reviewstatus",
        "desc": "The level of review for this submission, namely http://www.ncbi.nlm.nih.gov/clinvar/docs/variation_report/#review_status.",
        "type": "string"
      },
      {
        "name": "collectionmethod",
        "desc": "The method by which the submitter obtained the information provided.",
        "type": "string"
      },
      {
        "name": "origincounts",
        "desc": "The reported origin and the number of observations for each origin.",
        "type": "string"
      },
      {
        "name": "submitter",
        "desc": "The submitter of this record.",
        "type": "string"
      },
      {
        "name": "scv",
        "desc": "The accession and current version assigned by ClinVar to the submitted interpretation of the variation-condition relationship.",
        "type": "string"
      },
      {
        "name": "submittedgenesymbol",
        "desc": "The symbol provided by the submitter for the gene affected by the variant. May be null.",
        "type": "string"
      }
    ]
  },
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/allele_gene.txt.gz",
    "target": "s3://viz.fredhutch.org.public.data/pub/clinvar/allele_gene/allele_gene",
    "update": "Updated weekly.",
    "desc": "Reports per ClinVar's AlleleID, the genes that are related to that gene and how they are related. The values for category are: Asserted, but not computed: Submitted as related to a gene, but not within the location of that gene on the genome. Genes overlapped by variant: The gene and variant overlap.  Near gene, downstream: Outside the location of the gene on the genome, within 5 kb.  Near gene, upstream: Outside the location of the gene on the genome, within 5 kb.  Within multiple genes by overlap: The variant is within genes that overlap on the genome. Includes introns.  Within single gene: The variant is in only one gene.  Includes introns.",
    "fields": [
      {
        "name": "alleleid",
        "desc": "The integer identifier assigned by ClinVar to each simple allele.",
        "type": "string"
      },
      {
        "name": "geneid",
        "desc": "Integer, GeneID in NCBI's Gene database.",
        "type": "string"
      },
      {
        "name": "symbol",
        "desc": "Character, Symbol preferred in NCBI's Gene database. Is the symbol from HGNC when available.",
        "type": "string"
      },
      {
        "name": "name",
        "desc": "Character, full name of the gene.",
        "type": "string"
      },
      {
        "name": "genesperalleleid",
        "desc": "Integer, number of genes related to the allele.",
        "type": "string"
      },
      {
        "name": "category",
        "desc": "Character, type of allele-gene relationship.",
        "type": "string"
      },
      {
        "name": "source",
        "desc": "Character, was the relationship submitted or calculated? ",
        "type": "string"
      }
    ]
  },
  {
    "transfer": "ftp",
    "source": "ftp://ftp.ncbi.nlm.nih.gov/pub/clinvar/tab_delimited/organization_summary.txt",
    "target": "s3://viz.fredhutch.org.public.data/pub/clinvar/organization_summary/organization_summary",
    "update": "Updated weekly.",
    "desc": "None given.",
    "fields": [
      {
        "name": "organization",
        "desc": "The name of the lab and the institution of which it is part.",
        "type": "string"
      },
      {
        "name": "organization id",
        "desc": "The id used in ClinVar and GTR; often reported as OrgID; append to https://www.ncbi.nlm.nih.gov/clinvar/submitters to review more details",
        "type": "string"
      },
      {
        "name": "institution type",
        "desc": "Type of organization.",
        "type": "string"
      },
      { "name": "street address", "desc": "Street address.", "type": "string" },
      { "name": "country", "desc": "Country.", "type": "string" },
      {
        "name": "number of clinvar submissions",
        "desc": "Number of submission to ClinVar.",
        "type": "string"
      },
      {
        "name": "date last submitted",
        "desc": "Last date on a public submission from this organization.",
        "type": "string"
      },
      {
        "name": "maximum review status",
        "desc": "The 'most stars' valid for any submission from this organization.",
        "type": "string"
      },
      {
        "name": "collection methods",
        "desc": "Comma-delimited list of methods used to determine information for the submission.",
        "type": "string"
      },
      {
        "name": "novel and updates",
        "desc": "Values are novel, novel and updates.  The latter indicates the submitter has provided updates.",
        "type": "string"
      },
      {
        "name": "clinical significance categories submitted",
        "desc": "List of types of interpretations from this organization.",
        "type": "string"
      },
      {
        "name": "number of submissions from clinical testing",
        "desc": "Number of submissions for the list of categories in 'collection methods'.",
        "type": "string"
      },
      {
        "name": "number of submissions from research",
        "desc": "Number of submissions for the list of categories in 'collection methods'.",
        "type": "string"
      },
      {
        "name": "number of submissions from literature only",
        "desc": "Number of submissions for the list of categories in 'collection methods'.",
        "type": "string"
      },
      {
        "name": "number of submissions from curation",
        "desc": "Number of submissions for the list of categories in 'collection methods'.",
        "type": "string"
      },
      {
        "name": "number of submissions from phenotyping",
        "desc": "Number of submissions for the list of categories in 'collection methods'.",
        "type": "string"
      }
    ]
  }
]
